atsamd-rs/atsamd/svd/PIC32CX1025SG41080.svd
            <register>
               <name>IHCE</name>
               <description>IP Header Checksum Errors Register</description>
               <addressOffset>0x1A8</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>HCKER</name>
                     <description>IP Header Checksum Errors</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TCE</name>
               <description>TCP Checksum Errors Register</description>
               <addressOffset>0x1AC</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TCKER</name>
                     <description>TCP Checksum Errors</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UCE</name>
               <description>UDP Checksum Errors Register</description>
               <addressOffset>0x1B0</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>UCKER</name>
                     <description>UDP Checksum Errors</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TISUBN</name>
               <description>1588 Timer Increment [15:0] Sub-Nanoseconds Register</description>
               <addressOffset>0x1BC</addressOffset>
               <fields>
                  <field>
                     <name>LSBTIR</name>
                     <description>Lower Significant Bits of Timer Increment</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TSH</name>
               <description>1588 Timer Seconds High [15:0] Register</description>
               <addressOffset>0x1C0</addressOffset>
               <fields>
                  <field>
                     <name>TCS</name>
                     <description>Timer Count in Seconds</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TSSSL</name>
               <description>1588 Timer Sync Strobe Seconds [31:0] Register</description>
               <addressOffset>0x1C8</addressOffset>
               <fields>
                  <field>
                     <name>VTS</name>
                     <description>Value of Timer Seconds Register Capture</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TSSN</name>
               <description>1588 Timer Sync Strobe Nanoseconds Register</description>
               <addressOffset>0x1CC</addressOffset>
               <fields>
                  <field>
                     <name>VTN</name>
                     <description>Value Timer Nanoseconds Register Capture</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>30</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TSL</name>
               <description>1588 Timer Seconds [31:0] Register</description>
               <addressOffset>0x1D0</addressOffset>
               <fields>
                  <field>
                     <name>TCS</name>
                     <description>Timer Count in Seconds</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TN</name>
               <description>1588 Timer Nanoseconds Register</description>
               <addressOffset>0x1D4</addressOffset>
               <fields>
                  <field>
                     <name>TNS</name>
                     <description>Timer Count in Nanoseconds</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>30</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TA</name>
               <description>1588 Timer Adjust Register</description>
               <addressOffset>0x1D8</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>ITDT</name>
                     <description>Increment/Decrement</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>30</bitWidth>
                  </field>
                  <field>
                     <name>ADJ</name>
                     <description>Adjust 1588 Timer</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TI</name>
               <description>1588 Timer Increment Register</description>
               <addressOffset>0x1DC</addressOffset>
               <fields>
                  <field>
                     <name>CNS</name>
                     <description>Count Nanoseconds</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ACNS</name>
                     <description>Alternative Count Nanoseconds</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>NIT</name>
                     <description>Number of Increments</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EFTSL</name>
               <description>PTP Event Frame Transmitted Seconds Low Register</description>
               <addressOffset>0x1E0</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RUD</name>
                     <description>Register Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EFTN</name>
               <description>PTP Event Frame Transmitted Nanoseconds</description>
               <addressOffset>0x1E4</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RUD</name>
                     <description>Register Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>30</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EFRSL</name>
               <description>PTP Event Frame Received Seconds Low Register</description>
               <addressOffset>0x1E8</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RUD</name>
                     <description>Register Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EFRN</name>
               <description>PTP Event Frame Received Nanoseconds</description>
               <addressOffset>0x1EC</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RUD</name>
                     <description>Register Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>30</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PEFTSL</name>
               <description>PTP Peer Event Frame Transmitted Seconds Low Register</description>
               <addressOffset>0x1F0</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RUD</name>
                     <description>Register Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PEFTN</name>
               <description>PTP Peer Event Frame Transmitted Nanoseconds</description>
               <addressOffset>0x1F4</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RUD</name>
                     <description>Register Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>30</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PEFRSL</name>
               <description>PTP Peer Event Frame Received Seconds Low Register</description>
               <addressOffset>0x1F8</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RUD</name>
                     <description>Register Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PEFRN</name>
               <description>PTP Peer Event Frame Received Nanoseconds</description>
               <addressOffset>0x1FC</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RUD</name>
                     <description>Register Update</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>30</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RLPITR</name>
               <description>Receive LPI transition Register</description>
               <addressOffset>0x270</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RLPITR</name>
                     <description>Count number of times transition from rx normal idle to low power idle</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RLPITI</name>
               <description>Receive LPI Time Register</description>
               <addressOffset>0x274</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RLPITI</name>
                     <description>Increment once over 16 ahb clock when LPI indication bit 20 is set in rx mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TLPITR</name>
               <description>Receive LPI transition Register</description>
               <addressOffset>0x278</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TLPITR</name>
                     <description>Count number of times enable LPI tx bit 20 goes from low to high</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TLPITI</name>
               <description>Receive LPI Time Register</description>
               <addressOffset>0x27C</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TLPITI</name>
                     <description>Increment once over 16 ahb clock when LPI indication bit 20 is set in tx mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
