atsamd-rs/atsamd/svd/PIC32CX1025SG41080.svd
            <register>
               <name>MC2R</name>
               <description>MMC Control 2</description>
               <addressOffset>0x205</addressOffset>
               <size>8</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>SRESP</name>
                     <description>e.MMC Abort Wait IRQ</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ABOOT</name>
                     <description>e.MMC Abort Boot</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ACR</name>
               <description>AHB Control</description>
               <addressOffset>0x208</addressOffset>
               <fields>
                  <field>
                     <name>BMAX</name>
                     <description>AHB Maximum Burst</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>BMAXSelect</name>
                        <enumeratedValue>
                           <name>INCR16</name>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR8</name>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INCR4</name>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SINGLE</name>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CC2R</name>
               <description>Clock Control 2</description>
               <addressOffset>0x20C</addressOffset>
               <fields>
                  <field>
                     <name>FSDCLKD</name>
                     <description>Force SDCK Disabled</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>FSDCLKDSelect</name>
                        <enumeratedValue>
                           <name>NOEFFECT</name>
                           <description>No effect</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>SDCLK can be stopped at any time after DATA transfer.SDCLK enable forcing for 8 SDCLK cycles is disabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CACR</name>
               <description>Capabilities Control</description>
               <addressOffset>0x230</addressOffset>
               <fields>
                  <field>
                     <name>CAPWREN</name>
                     <description>Capabilities Registers Write Enable (Required to write the correct frequencies in the Capabilities Registers)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>KEY</name>
                     <description>Key (0x46)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>KEYSelect</name>
                        <enumeratedValue>
                           <name>KEY</name>
                           <description>Key</description>
                           <value>0x46</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>DBGR</name>
               <description>Debug</description>
               <addressOffset>0x234</addressOffset>
               <size>8</size>
               <fields>
                  <field>
                     <name>NIDBG</name>
                     <description>Non-intrusive debug enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>NIDBGSelect</name>
                        <enumeratedValue>
                           <name>IDBG</name>
                           <description>Debugging is intrusive (reads of BDPR from debugger are considered and increment the internal buffer pointer)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NIDBG</name>
                           <description>Debugging is not intrusive (reads of BDPR from debugger are discarded and do not increment the internal buffer pointer)</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
